# 9 数据汇总和组操作

## 9.1.0 分组机制

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'], 
                   'data1' : [1, 2, 3, 4, 6]})
df

   data1 key1 key2
0      1    a  one
1      2    a  two
2      3    b  one
3      4    b  two
4      6    a  one

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a    3.0
b    3.5
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     3.5
      two     2.0
b     one     3.0
      two     4.0
Name: data1, dtype: float64

In [6]:
means.unstack()

key2  one  two
key1
a     3.5  2.0
b     3.0  4.0

In [7]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]) # df['data1']没有州,年这些信息,怎么分组的呢?

In [8]:
df['data1'].groupby([states, years]).mean()

California  2005    2.0
            2006    3.0
Ohio        2005    2.5
            2006    6.0
Name: data1, dtype: float64

In [9]:
df['data1']

0    1
1    2
2    3
3    4
4    6
Name: data1, dtype: int64

In [10]:
df

   data1 key1 key2
0      1    a  one
1      2    a  two
2      3    b  one
3      4    b  two
4      6    a  one

In [11]:
df.groupby('key1').mean()

      data1
key1
a       3.0
b       3.5

In [12]:
df.groupby(['key1', 'key2']).mean()

           data1
key1 key2
a    one     3.5
     two     2.0
b    one     3.0
     two     4.0

In [13]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64